1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
data = [4, 8, 15, 16, 23 , 42]

In [6]:
s = pd.Series(data)

In [7]:
print(type(s))
print(s)

<class 'pandas.core.series.Series'>
0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [9]:
l = [1,2,3,4,5,6,7,8,9,10]
s1 = pd.Series(l)
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

3. Create a Pandas DataFrame that contains the following data:

In [11]:
d = { "Name" :[ "Alice", "Bob", "Claire"],
     "Age" : [25,30,27],
     "Gender" : ["Female" , "Male" , "Female"]
    }
db = pd.DataFrame(d)
db

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

> In pandas a DataFrame is a 2d data structure which has columns and rows, whereas Series is a 1d data structure with a single column.
>> A DataFrame is similar to a SQL table or a spreadsheet. In other words DataFrame can also be defined as a collection of series.
eg :

In [13]:
d = { "Name" :[ "Alice", "Bob", "Claire"],
     "Age" : [25,30,27],
     "Gender" : ["Female" , "Male" , "Female"]
    }
db = pd.DataFrame(d)
db

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
db1 = db["Name"]
db1

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

here db is a DataFrame, where as db1 is a Series.

* hence,each column is a pandas Series that holds the data for that particular column.

5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [17]:
d = { "Name" :[ "Alice", "Bob", "Claire"],
     "Age" : [25,30,27],
     "Gender" : ["Female" , "Male" , "Female"]
    }
db = pd.DataFrame(d)

In [20]:
db.head(3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [22]:
db.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [24]:
db.describe() #only takes integer data for statistical analysis

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [25]:
db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [31]:
db.sort_values("Age")

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [32]:
db.sort_values("Name")

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [41]:
db.groupby('Age')

...and many more.

* head() and tail(): These functions are used to view the first or last few rows of the DataFrame, respectively. They are useful for quickly checking the structure of the DataFrame.
* describe(): This function provides summary statistics for numerical columns in the DataFrame, such as count, mean, standard deviation, minimum, and maximum values.
* info(): This function provides information about the DataFrame, such as the number of rows and columns, the data types of each column, and the memory usage.
* sort_values(): This function sorts the DataFrame based on one or more columns.
* groupby(): This function is used to group the DataFrame by one or more columns and perform operations on each group, such as calculating the mean or sum.
* drop(): This function is used to remove one or more columns or rows from the DataFrame.

6. Which of the following is mutable in nature Series, DataFrame, Panel?

* DataFrame , Panel , Series all three of them are mutable in nature. 
> Tho there are some differences on how the mutability works for each one.

7. Create a DataFrame using multiple Series. Explain with an example.

In [6]:
name = pd.Series(["Tom" , "Jerry" , "Bob"])
char = pd.Series(["Cat" , "Mouse" ,"Dog"])
colour = pd.Series(["Blue" ,"Brown" , "Orange"])

In [9]:
db = pd.DataFrame({"Name" : name , "Character" : char , "Colour" : colour})

In [10]:
db

    Name Character  Colour
0    Tom       Cat    Blue
1  Jerry     Mouse   Brown
2    Bob       Dog  Orange